flow-around-moving-cylinder/fluid-openfoam/system/preCICE_Adapter
// -*- C++ -*-

type preciceAdapterFunctionObject;
libs ("libpreciceAdapterFunctionObject.so");


// ************************************************************************* //